package danyl.Game;

public class Rules {

    private static Rules rulesBoard;
    private String rules;

    public Rules()
    {
//        rules ="//    В каждом раунде появляется плитка номинала «2» или «4» \n" +
//                "//    Нажатием стрелки игрок может скинуть все плитки игрового поля в одну из 4 сторон. Если при сбрасывании две плитки одного номинала «налетают» одна на другую, то они слипаются в одну, номинал которой равен сумме соединившихся плиток.\n" +
//                "//    После каждого хода на свободной секции поля появляется новая плитка номиналом «2» или «4». \n" +
//                "//    Если при нажатии кнопки местоположение плиток или их номинал не изменится, то ход не совершается.\n" +
//                "//    Если в одной строчке или в одном столбце находится более двух плиток одного номинала, то при сбрасывании они начинают слипаться с той стороны, в которую были направлены. \n" +
//                "//    Например, находящиеся в одной строке плитки (4, 4, 4) после хода влево они превратятся в (8, 4), а после хода вправо — в (4, 8). \n" +
//                "//    Данная обработка неоднозначности позволяет более точно формировать стратегию игры.\n" +
//                "//    За каждое соединение игровые очки увеличиваются на номинал получившейся плитки.\n" +
//                "//    Игра заканчивается поражением, если после очередного хода невозможно совершить действие.";
    }
//    public static Rules getInstance()
//    {
//        if(rulesBoard == null)
//        {
//            rulesBoard = new Rules();
//        }
//        return rulesBoard;
//    }
}
